Repository: mitre88/duo_calculator-
Catalog: App/DuoCalculator/Resources/Localizable.xcstrings
Source language: es_mx
Languages: en

# converter.from
source: DE
en: FROM

# converter.inputValue
source: valor a convertir
en: value to convert

# converter.result
source: resultado de la conversión
en: conversion result

# converter.sendToCalculator
source: Enviar a científica
en: Send to scientific

# converter.swap
source: intercambiar unidades
en: swap units

# converter.to
source: A
en: TO

# converter.useCalculatorValue
source: Usar valor de la calculadora
en: Use calculator value

# display.copy
source: Copiar
en: Copy

# display.expression
source: Expresión
en: Expression

# display.paste
source: Pegar
en: Paste

# display.preview
source: Vista previa
en: Live result

# display.result
source: Resultado
en: Result

# error.divisionByZero
source: División entre cero
en: Division by zero

# error.domain
source: Fuera de dominio
en: Out of domain

# error.overflow
source: Desbordamiento
en: Overflow

# error.syntax
source: Expresión incompleta
en: Incomplete expression

# error.tooComplex
source: Expresión demasiado larga
en: Expression too long

# hint.function
source: Se aplica al número actual.
en: Applies to the current number.

# hint.memory
source: Memoria de la calculadora.
en: Calculator memory.

# hint.operator
source: Toca otro número para operar.
en: Enter another number to operate.

# hint.toggle
source: Cambia el modo del teclado.
en: Toggles the keypad mode.

# key.acosh
source: arco coseno hiperbólico
en: inverse hyperbolic cosine

# key.add
source: más
en: plus

# key.allClear
source: borrar todo
en: all clear

# key.angleMode
source: modo de ángulo
en: angle mode

# key.arccosine
source: arco coseno
en: arccosine

# key.arcsine
source: arco seno
en: arcsine

# key.arctangent
source: arco tangente
en: arctangent

# key.asinh
source: arco seno hiperbólico
en: inverse hyperbolic sine

# key.atanh
source: arco tangente hiperbólica
en: inverse hyperbolic tangent

# key.clear
source: borrar entrada
en: clear entry

# key.closeParen
source: cerrar paréntesis
en: close parenthesis

# key.cosh
source: coseno hiperbólico
en: hyperbolic cosine

# key.cosine
source: coseno
en: cosine

# key.cube
source: al cubo
en: cubed

# key.cubeRoot
source: raíz cúbica
en: cube root

# key.decimal
source: punto decimal
en: decimal point

# key.divide
source: entre
en: divided by

# key.equals
source: igual
en: equals

# key.euler
source: número e
en: Euler's number

# key.exponentEntry
source: exponente, por diez a la
en: exponent entry, times ten to the

# key.exponential
source: e elevado a x
en: e to the power of x

# key.log10
source: logaritmo base diez
en: log base ten

# key.log2
source: logaritmo base dos
en: log base two

# key.logBase
source: logaritmo en base y
en: logarithm base y

# key.memoryAdd
source: sumar a memoria
en: memory add

# key.memoryClear
source: borrar memoria
en: memory clear

# key.memoryRecall
source: recuperar memoria
en: memory recall

# key.memorySubtract
source: restar de memoria
en: memory subtract

# key.multiply
source: por
en: times

# key.naturalLog
source: logaritmo natural
en: natural logarithm

# key.nthRoot
source: raíz y de x
en: y-th root of x

# key.openParen
source: abrir paréntesis
en: open parenthesis

# key.percent
source: porcentaje
en: percent

# key.power
source: x elevado a y
en: x to the power of y

# key.powerOfTen
source: diez elevado a x
en: ten to the power of x

# key.powerOfTwo
source: dos elevado a x
en: two to the power of x

# key.random
source: número aleatorio
en: random number

# key.reciprocal
source: recíproco, uno entre x
en: reciprocal, one over x

# key.reversedPower
source: y elevado a x
en: y to the power of x

# key.second
source: segunda función
en: second function

# key.sine
source: seno
en: sine

# key.sinh
source: seno hiperbólico
en: hyperbolic sine

# key.square
source: al cuadrado
en: squared

# key.squareRoot
source: raíz cuadrada
en: square root

# key.subtract
source: menos
en: minus

# key.switchToDegrees
source: cambiar a grados
en: switch to degrees

# key.switchToRadians
source: cambiar a radianes
en: switch to radians

# key.tangent
source: tangente
en: tangent

# key.tanh
source: tangente hiperbólica
en: hyperbolic tangent

# key.toggleSign
source: cambiar signo
en: change sign

# keypad.basic
source: teclado básico
en: basic keypad

# keypad.functionBlock
source: funciones científicas
en: scientific functions

# keypad.scientific
source: teclado científico
en: scientific keypad

# mode.converter
source: Unidades
en: Units

# mode.programmer
source: Programador
en: Programmer

# mode.scientific
source: Científica
en: Scientific

# modebar.backspace
source: borrar
en: delete

# modebar.cursorLeft
source: cursor a la izquierda
en: cursor left

# modebar.cursorRight
source: cursor a la derecha
en: cursor right

# modebar.mode
source: Modo
en: Mode

# modebar.settings
source: ajustes
en: settings

# programmer.sendToCalculator
source: A científica
en: To scientific

# programmer.signed
source: Con signo
en: Signed

# settings.accent
source: Color de acento
en: Accent color

# settings.accent.amber
source: Ámbar
en: Amber

# settings.accent.graphite
source: Grafito
en: Graphite

# settings.accent.indigo
source: Índigo
en: Indigo

# settings.accent.mint
source: Menta
en: Mint

# settings.appearance
source: Tema
en: Theme

# settings.appearance.dark
source: Oscuro
en: Dark

# settings.appearance.light
source: Claro
en: Light

# settings.appearance.system
source: Sistema
en: System

# settings.aurora
source: Fondo aurora
en: Aurora background

# settings.done
source: Listo
en: Done

# settings.grouping
source: Separador de miles
en: Thousands separator

# settings.haptics
source: Hápticos
en: Haptics

# settings.keepAwake
source: Mantener pantalla encendida
en: Keep screen awake

# settings.precision
source: Precisión (cálculo / pantalla)
en: Precision (compute / display)

# settings.scientificLandscape
source: Científica al plegar en horizontal
en: Scientific when folded in landscape

# settings.section.about
source: Acerca de
en: About

# settings.section.appearance
source: Apariencia
en: Appearance

# settings.section.format
source: Formato
en: Format

# settings.section.interaction
source: Interacción
en: Interaction

# settings.source
source: Código fuente en GitHub
en: Source code on GitHub

# settings.title
source: Ajustes
en: Settings

# settings.trueBlack
source: Negro OLED puro
en: Pure OLED black

# settings.version
source: Versión
en: Version

# unit.angle.arcminute
source: minuto de arco
en: arcminute

# unit.angle.arcsecond
source: segundo de arco
en: arcsecond

# unit.angle.degree
source: grado
en: degree

# unit.angle.gradian
source: gradián
en: gradian

# unit.angle.radian
source: radián
en: radian

# unit.angle.turn
source: vuelta
en: turn

# unit.area.hectare
source: hectárea
en: hectare

# unit.area.squareCentimeter
source: centímetro cuadrado
en: square centimeter

# unit.area.squareFoot
source: pie cuadrado
en: square foot

# unit.area.squareInch
source: pulgada cuadrada
en: square inch

# unit.area.squareKilometer
source: kilómetro cuadrado
en: square kilometer

# unit.area.squareMeter
source: metro cuadrado
en: square meter

# unit.area.squareMile
source: milla cuadrada
en: square mile

# unit.area.squareMillimeter
source: milímetro cuadrado
en: square millimeter

# unit.area.squareYard
source: yarda cuadrada
en: square yard

# unit.category.angle
source: Ángulo
en: Angle

# unit.category.area
source: Área
en: Area

# unit.category.duration
source: Tiempo
en: Time

# unit.category.energy
source: Energía
en: Energy

# unit.category.information
source: Datos
en: Data

# unit.category.length
source: Longitud
en: Length

# unit.category.mass
source: Masa
en: Mass

# unit.category.pressure
source: Presión
en: Pressure

# unit.category.speed
source: Velocidad
en: Speed

# unit.category.temperature
source: Temperatura
en: Temperature

# unit.category.volume
source: Volumen
en: Volume

# unit.duration.day
source: día
en: day

# unit.duration.hour
source: hora
en: hour

# unit.duration.millisecond
source: milisegundo
en: millisecond

# unit.duration.minute
source: minuto
en: minute

# unit.duration.second
source: segundo
en: second

# unit.duration.week
source: semana
en: week

# unit.duration.year
source: año
en: year

# unit.energy.calorie
source: caloría
en: calorie

# unit.energy.joule
source: julio
en: joule

# unit.energy.kilocalorie
source: kilocaloría
en: kilocalorie

# unit.energy.kilojoule
source: kilojulio
en: kilojoule

# unit.energy.kilowattHour
source: kilovatio-hora
en: kilowatt-hour

# unit.energy.wattHour
source: vatio-hora
en: watt-hour

# unit.length.astronomicalUnit
source: unidad astronómica
en: astronomical unit

# unit.length.centimeter
source: centímetro
en: centimeter

# unit.length.foot
source: pie
en: foot

# unit.length.inch
source: pulgada
en: inch

# unit.length.kilometer
source: kilómetro
en: kilometer

# unit.length.lightYear
source: año luz
en: light year

# unit.length.meter
source: metro
en: meter

# unit.length.micrometer
source: micrómetro
en: micrometer

# unit.length.mile
source: milla
en: mile

# unit.length.millimeter
source: milímetro
en: millimeter

# unit.length.nanometer
source: nanómetro
en: nanometer

# unit.length.nauticalMile
source: milla náutica
en: nautical mile

# unit.length.yard
source: yarda
en: yard

# unit.mass.carat
source: quilate
en: carat

# unit.mass.gram
source: gramo
en: gram

# unit.mass.kilogram
source: kilogramo
en: kilogram

# unit.mass.milligram
source: miligramo
en: milligram

# unit.mass.ounce
source: onza
en: ounce

# unit.mass.pound
source: libra
en: pound

# unit.mass.tonne
source: tonelada
en: tonne

# unit.pressure.atmosphere
source: atmósfera
en: atmosphere

# unit.pressure.inchOfMercury
source: pulgada de mercurio
en: inch of mercury

# unit.pressure.millimeterOfMercury
source: milímetro de mercurio
en: millimeter of mercury

# unit.pressure.psi
source: libra por pulgada cuadrada
en: pound per square inch

# unit.speed.feetPerSecond
source: pies por segundo
en: feet per second

# unit.speed.kilometersPerHour
source: kilómetros por hora
en: kilometers per hour

# unit.speed.knot
source: nudo
en: knot

# unit.speed.metersPerSecond
source: metros por segundo
en: meters per second

# unit.speed.milesPerHour
source: millas por hora
en: miles per hour

# unit.temperature.celsius
source: grado Celsius
en: degree Celsius

# unit.temperature.fahrenheit
source: grado Fahrenheit
en: degree Fahrenheit

# unit.volume.cubicMeter
source: metro cúbico
en: cubic meter

# unit.volume.cupUS
source: taza (EE. UU.)
en: cup (US)

# unit.volume.fluidOunceUS
source: onza líquida (EE. UU.)
en: fluid ounce (US)

# unit.volume.gallonUK
source: galón imperial
en: imperial gallon

# unit.volume.gallonUS
source: galón (EE. UU.)
en: gallon (US)

# unit.volume.liter
source: litro
en: liter

# unit.volume.milliliter
source: mililitro
en: milliliter

# unit.volume.pintUS
source: pinta (EE. UU.)
en: pint (US)

# unit.volume.quartUS
source: cuarto (EE. UU.)
en: quart (US)

# unit.volume.tablespoonUS
source: cucharada (EE. UU.)
en: tablespoon (US)

# unit.volume.teaspoonUS
source: cucharadita (EE. UU.)
en: teaspoon (US)
